
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриОткрытии()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Хранилище
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК Таблица
	|ГДЕ
	|	Таблица.Объект = &Объект
	|	И Таблица.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Объект", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("Наименование", "");
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Диагностика = Выборка.Хранилище.Получить();
		
		Для Каждого Элемент Из Диагностика Цикл
			Новая = Этапы.Добавить();
			Новая.Этап = Элемент.Представление;
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

Процедура ЭтапыПриАктивизацииСтроки(Элемент)
	Текущая = ЭлементыФормы.Этапы.ТекущаяСтрока;
	Если Текущая = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Найденный = Неопределено;
	Для Каждого Элемент Из Диагностика Цикл
		Если Элемент.Представление = Текущая.Этап Тогда
			Найденный = Элемент;
			Прервать;
		КонецЕсли;;
	КонецЦикла;
	
	Затраты = Найденный.Значение.Затраты;
	ЭлементыФормы.Затраты.СоздатьКолонки();
	
	НовыеЗаписи = Найденный.Значение.НовыеЗаписи;
	ЭлементыФормы.НовыеЗаписи.СоздатьКолонки();
КонецПроцедуры

Процедура ЗатратыПриАктивизацииСтроки(Элемент)	
	Текущая = ЭлементыФормы.Затраты.ТекущаяСтрока;
	Если Текущая = Неопределено Тогда
		Возврат;
	Иначе
		База = Новый ТаблицаЗначений;
	КонецЕсли;
	
	База = Текущая.Диагностика_База;
	ЭлементыФормы.База.СоздатьКолонки();
	Решение = Текущая.Диагностика_Решение;
	Способ = Текущая.Диагностика_СпособРаспределения;
	
КонецПроцедуры

Процедура БазаВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	Текущая = ЭлементыФормы.База.ТекущаяСтрока;
	Если Текущая = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Колонка.Имя = "Культура" Тогда
		ОткрытьЗначение(ВыбраннаяСтрока[Колонка.Имя]);
	КонецЕсли;
КонецПроцедуры

Процедура НоваяПроцедура()
	Сообщить("Привет");
КонецПроцедуры